PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rcu.c
/*!
    \file    gd32f3x0_hal_rcu.c
    \brief   RCU driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

/* define clock source */
#define SEL_IRC8M       0x00U
#define SEL_HXTAL       0x01U
#define SEL_PLL         0x02U
#define RCU_MODIFY(__delay)     do{                                     \
                                    volatile uint32_t i;                \
                                    if(0 != __delay){                   \
                                        RCU_CFG0 |= RCU_AHB_CKSYS_DIV2; \
                                        for(i=0; i<__delay; i++){       \
                                        }                               \
                                        RCU_CFG0 |= RCU_AHB_CKSYS_DIV4; \
                                        for(i=0; i<__delay; i++){       \
                                        }                               \
                                    }                                   \
                                }while(0)

/* define startup timeout count */
#define OSC_STARTUP_TIMEOUT            ((uint32_t)0x000FFFFFU)
#define LXTAL_STARTUP_TIMEOUT          ((uint32_t)0x03FFFFFFU)

/* CKOUT GPIOA */
#define _CKOUT_GPIO_CLK_ENABLE()       hal_rcu_periph_clk_enable(RCU_GPIOA)
#define _CKOUT_GPIO_PORT               GPIOA
#define _CKOUT_GPIO_PIN                GPIO_PIN_8
#define _RCU_CKSYSSRC_INDEX(x)         (x)

hal_rcu_irq_struct rcu_irq = {NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL};

int32_t g_systemcoreclock = 8000000;
extern hal_sys_timebase_source_enum g_basetick_source;

/* RCU system clock oscillator stable flag */
static const hal_rcu_flag_enum s_rcu_stab_flag[] = {
    RCU_FLAG_IRC8MSTB,
    RCU_FLAG_HXTALSTB,
    RCU_FLAG_PLLSTB
};

/* RCU system clock source timeout */
static const uint32_t s_rcu_timeout[] = {
    HAL_IRC8M_TIMEOUT,
    HAL_HXTAL_TIMEOUT,
    HAL_PLL_TIMEOUT
};

/* RCU system clock source */
static const uint32_t s_rcu_scss[] = {
    RCU_SCSS_IRC8M,
    RCU_SCSS_HXTAL,
    RCU_SCSS_PLL
};

/*!
    \brief      configure the RCU oscillators
    \param[in]  rcu_osci: the pointer of the RCU oscillators structure
                  hxtal: HXTAL status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  lxtal: LXTAL status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  irc48m: IRC48M status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  irc28m: IRC28M status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    calibration_value: calibration value
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  irc8m: IRC8M status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    calibration_value: calibration value
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  irc40k: IRC40K status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  pll: PLL status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                    pll_source: RCU_PLL_SRC_HXTAL_IRC48M, RCU_PLL_SRC_IRC8M_DIV2
                    pll_presel: the argument could be selected from enumeration <hal_rcu_pll_presel_enum>
                    pre_div: the argument could be selected from enumeration <hal_rcu_pll_prediv_enum>
                    pll_mul: the argument could be selected from enumeration <hal_rcu_pll_mul_enum>
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
int32_t hal_rcu_osci_config(hal_rcu_osci_struct *rcu_osci)
{
    FlagStatus pwr_state = RESET;

