PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rcu.c
    /* configure IRC48M */
    if(ENABLE == rcu_osci->irc48m.need_configure) {
        /* set the IRC40K new state */
        if(RCU_OSC_ON == rcu_osci->irc48m.state) {
            hals_rcu_osci_on(RCU_IRC48M);

            /* wait till IRC40K is stable */
            if(ERROR == hals_rcu_osci_stab_wait(RCU_IRC48M)) {
                return HAL_ERR_TIMEOUT;
            }
        } else {
            uint32_t tick_start = 0U;

            hals_rcu_osci_off(RCU_IRC48M);

            tick_start = hal_sys_basetick_count_get();

            /* wait till IRC48M is disabled */
            while(RESET != (RCU_ADDCTL & RCU_ADDCTL_IRC48MSTB)) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, HAL_IRC48M_TIMEOUT)) {
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    }

    /* configure IRC40K */
    if(ENABLE == rcu_osci->irc40k.need_configure) {
        /* set the IRC40K new state */
        if(RCU_OSC_OFF != rcu_osci->irc40k.state) {
            hals_rcu_osci_on(RCU_IRC40K);

            /* wait till IRC40K is stable */
            if(ERROR == hals_rcu_osci_stab_wait(RCU_IRC40K)) {
                return HAL_ERR_TIMEOUT;
            }
        } else {
            uint32_t tick_start = 0U;

            hals_rcu_osci_off(RCU_IRC40K);

            tick_start = hal_sys_basetick_count_get();

            /* wait till IRC40K is disabled */
            while(RESET != (RCU_RSTSCK & RCU_RSTSCK_IRC40KSTB)) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, HAL_IRC40K_TIMEOUT)) {
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
    }

    /* configure PLL */
    if(ENABLE == rcu_osci->pll.need_configure) {
        /* check if the PLL is used as system clock or not */
        if(RCU_OSC_NONE != rcu_osci->pll.state) {
            if(RCU_SCSS_PLL != hals_rcu_system_clock_source_get()) {
                uint32_t tick_start = 0U;

                if(RCU_OSC_ON == rcu_osci->pll.state) {
                    hals_rcu_osci_off(RCU_PLL_CK);

                    tick_start = hal_sys_basetick_count_get();

                    /* wait till PLL is disabled */
                    while(RESET != (RCU_CTL0 & RCU_CTL0_PLLSTB)) {
                        if(SET == hal_sys_basetick_timeout_check(tick_start, HAL_PLL_TIMEOUT)) {
                            return HAL_ERR_TIMEOUT;
                        }
                    }

                    /* configure the PLL */
                    hals_rcu_pll_preselection_config(rcu_osci->pll.pll_presel);
                    hals_rcu_hxtal_prediv_config(rcu_osci->pll.pre_div);
                    hals_rcu_pll_config(rcu_osci->pll.pll_source, rcu_osci->pll.pll_mul);

                    hals_rcu_osci_on(RCU_PLL_CK);

                    /* wait till PLL is stable */
                    if(ERROR == hals_rcu_osci_stab_wait(RCU_PLL_CK)) {
                        return HAL_ERR_TIMEOUT;
                    }
                } else {
                    hals_rcu_osci_off(RCU_PLL_CK);

                    tick_start = hal_sys_basetick_count_get();

                    /* wait till PLL is disabled */
                    while(RESET != (RCU_CTL0 & RCU_CTL0_PLLSTB)) {
                        if(SET == hal_sys_basetick_timeout_check(tick_start, HAL_PLL_TIMEOUT)) {
                            return HAL_ERR_TIMEOUT;
                        }
                    }
                }
            } else {
                return HAL_ERR_VAL;
            }
        }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      configure the clock out to output on CKOUT pin
    \param[in]  ckout_src: clock out source
                  the argument could be selected from enumeraion <hal_rcu_ckout_src_enum>
    \param[in]  ckout_div: clock out divider
                  the argument could be selected from enumeraion <hal_rcu_ckout_div_enum>
    \param[out] none
    \retval
*/
void hal_rcu_clock_out_config(hal_rcu_ckout_src_enum ckout_src, \
                              hal_rcu_ckout_div_enum ckout_div)
{
    uint32_t clkout_src = 0U;

    hal_gpio_init_struct gpio_init_struct;

    _CKOUT_GPIO_CLK_ENABLE();

    /* configure clock out GPIO pin */
    gpio_init_struct.mode = GPIO_MODE_AF_PP;
    gpio_init_struct.ospeed = GPIO_OSPEED_50MHZ;
    gpio_init_struct.pull = GPIO_PULL_NONE;
    gpio_init_struct.af = GPIO_AF_0;

    hal_gpio_init(_CKOUT_GPIO_PORT, _CKOUT_GPIO_PIN, &gpio_init_struct);

    if(RCU_CKOUT_SRC_CKPLL_DIV1 == ckout_src) {
        clkout_src = RCU_CKOUTSRC_CKPLL_DIV1;
    } else {
        clkout_src = CFG0_CKOUTSEL(ckout_src);
    }

    /* clock out configuration */
    hals_rcu_ckout_config(clkout_src, ckout_div);
}

/*!
    \brief      deinitialize the RCU
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rcu_deinit(void)
{
    /* enable IRC8M */
    RCU_CTL0 |= RCU_CTL0_IRC8MEN;
    while(0U == (RCU_CTL0 & RCU_CTL0_IRC8MSTB)) {
    }
    
    RCU_MODIFY(0x50);

    RCU_CFG0 &= ~RCU_CFG0_SCS;

    /* reset CTL register */
    RCU_CTL0 &= ~(RCU_CTL0_HXTALEN | RCU_CTL0_CKMEN | RCU_CTL0_PLLEN | RCU_CTL0_HXTALBPS);
    RCU_CTL1 &= ~RCU_CTL1_IRC28MEN;

    /* reset RCU */
    RCU_CFG0 &= ~(RCU_CFG0_SCS | RCU_CFG0_AHBPSC | RCU_CFG0_APB1PSC | RCU_CFG0_APB2PSC | \
                  RCU_CFG0_ADCPSC | RCU_CFG0_CKOUTSEL | RCU_CFG0_CKOUTDIV | RCU_CFG0_PLLDV);
    RCU_CFG0 &= ~(RCU_CFG0_PLLSEL | RCU_CFG0_PLLMF | RCU_CFG0_PLLMF4 | RCU_CFG0_PLLDV);
#if (defined(GD32F350))
    RCU_CFG0 &= ~(RCU_CFG0_USBFSPSC);
    RCU_CFG2 &= ~(RCU_CFG2_CECSEL | RCU_CFG2_USBFSPSC2);
#endif /* GD32F350 */

    RCU_CFG1 &= ~(RCU_CFG1_PREDV | RCU_CFG1_PLLMF5 | RCU_CFG1_PLLPRESEL);
    RCU_CFG2 &= ~(RCU_CFG2_USART0SEL | RCU_CFG2_ADCSEL);
    RCU_CFG2 &= ~RCU_CFG2_IRC28MDIV;
    RCU_CFG2 &= ~RCU_CFG2_ADCPSC2;
    RCU_ADDCTL &= ~RCU_ADDCTL_IRC48MEN;
    RCU_INT = 0x00000000U;
    RCU_ADDINT = 0x00000000U;

    g_systemcoreclock = IRC8M_VALUE;
}

/*!
    \brief      initialize the RCU structure with the default values
    \param[in]  hal_struct_type: the argument could be selected from enumeration <hal_rcu_struct_type_enum>
    \param[in]  p_struct: pointer of the RCU structure
    \param[out] none
    \retval     none
*/
void hal_rcu_struct_init(hal_rcu_struct_type_enum rcu_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct) {
        HAL_DEBUGE("pointer [*p_struct] value is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

