PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rcu.c
    switch(rcu_struct_type) {
    case HAL_RCU_CLK_STRUCT:
        /* initialize rcu clock structure with the default values */
        ((hal_rcu_clk_struct *)p_struct)->clock_type = RCU_CLKTYPE_NONE;
        ((hal_rcu_clk_struct *)p_struct)->ahbclk_divider = RCU_SYSCLK_AHBDIV1;
        ((hal_rcu_clk_struct *)p_struct)->apb1clk_divider = RCU_AHBCLK_APB1DIV1;
        ((hal_rcu_clk_struct *)p_struct)->apb2clk_divider = RCU_AHBCLK_APB2DIV1;
        ((hal_rcu_clk_struct *)p_struct)->sysclk_source = RCU_SYSCLK_SRC_IRC8M;
        ((hal_rcu_clk_struct *)p_struct)->ck48mclk_source = RCU_USB_CK48MSRC_IRC48M;
        break;
    case HAL_RCU_OSCI_STRUCT:
        /* initialize rcu oscillator structure with the default values */
        ((hal_rcu_osci_struct *)p_struct)->hxtal.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->hxtal.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->lxtal.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->lxtal.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->irc48m.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->irc48m.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->irc28m.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->irc28m.adjust_value = 0U;
        ((hal_rcu_osci_struct *)p_struct)->irc28m.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->irc8m.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->irc8m.adjust_value = 0U;
        ((hal_rcu_osci_struct *)p_struct)->irc8m.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->irc40k.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->irc40k.state = RCU_OSC_NONE;
        ((hal_rcu_osci_struct *)p_struct)->pll.need_configure = DISABLE;
        ((hal_rcu_osci_struct *)p_struct)->pll.state = RCU_OSC_NONE;
        break;
    case HAL_RCU_PERIPHCLK_STRUCT:
        /* initialize rcu peripheral clock structure with the default values */
        ((hal_rcu_periphclk_struct *)p_struct)->periph_clock_type = RCU_PERIPH_CLKTYPE_NONE;
        ((hal_rcu_periphclk_struct *)p_struct)->adc_clock_source = RCU_ADCCK_IRC28M_DIV2;
        ((hal_rcu_periphclk_struct *)p_struct)->rtc_clock_source = RCU_RTC_CLKSRC_NONE;
        ((hal_rcu_periphclk_struct *)p_struct)->usart0_clock_source = RCU_USART0_CLKSRC_IRC8M;
#if defined(GD32F350)
        ((hal_rcu_periphclk_struct *)p_struct)->cec_clock_source = RCU_CEC_CLKSRC_DIV244;
        ((hal_rcu_periphclk_struct *)p_struct)->usbfs_clock_source = RCU_PLLCLK_USBFS_DIV1;
#endif /* GD32F350 */
        break;
    default:
        break;
    }
}

/*!
    \brief      enable the peripherals clock
    \param[in]  periph: RCU peripherals
                  the argument could be selected from enumeration <rcu_periph_enum>
    \param[out] none
    \retval     none
*/
void hal_rcu_periph_clk_enable(hal_rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) |= BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      disable the peripherals clock
    \param[in]  periph: RCU peripherals
                  the argument could be selected from enumeration <rcu_periph_enum>
    \param[out] none
    \retval     none
*/
void hal_rcu_periph_clk_disable(hal_rcu_periph_enum periph)
{
    RCU_REG_VAL(periph) &= ~BIT(RCU_BIT_POS(periph));
}

/*!
    \brief      enable the HXTAL clock monitor
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rcu_hxtal_clock_monitor_enable(void)
{
    RCU_CTL0 |= RCU_CTL0_CKMEN;
}

/*!
    \brief      disable the HXTAL clock monitor
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rcu_hxtal_clock_monitor_disable(void)
{
    RCU_CTL0 &= ~RCU_CTL0_CKMEN;
}

/*!
    \brief      reset the peripherals
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_GPIOxRST (x=A,B,C,D,F): reset GPIO ports
      \arg        RCU_TSIRST: reset TSI
      \arg        RCU_CFGCMPRST: reset CFGCMP
      \arg        RCU_ADCRST: reset ADC
      \arg        RCU_TIMERxRST (x=0,1,2,5,13,14,15,16): reset TIMER (RCU_TIMER5 only for GD32F350)
      \arg        RCU_SPIxRST (x=0,1): reset SPI
      \arg        RCU_USARTxRST (x=0,1): reset USART
      \arg        RCU_WWDGTRST: reset WWDGT
      \arg        RCU_I2CxRST (x=0,1): reset I2C
      \arg        RCU_USBFSRST: reset USBFS (only for GD32F350)
      \arg        RCU_PMURST: reset PMU
      \arg        RCU_DACRST: reset DAC (only for GD32F350)
      \arg        RCU_CECRST: reset CEC (only for GD32F350)
      \arg        RCU_CTCRST: reset CTC
    \param[out] none
    \retval     none
*/
void hal_rcu_periph_reset_enable(hal_rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) |= BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      disable reset the peripheral
    \param[in]  periph_reset: RCU peripherals reset, refer to rcu_periph_reset_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_GPIOxRST (x=A,B,C,D,F): reset GPIO ports
      \arg        RCU_TSIRST: reset TSI
      \arg        RCU_CFGCMPRST: reset CFGCMP
      \arg        RCU_ADCRST: reset ADC
      \arg        RCU_TIMERxRST (x=0,1,2,5,13,14,15,16): reset TIMER (RCU_TIMER5 only for GD32F350)
      \arg        RCU_SPIxRST (x=0,1,2): reset SPI
      \arg        RCU_USARTxRST (x=0,1): reset USART
      \arg        RCU_WWDGTRST: reset WWDGT
      \arg        RCU_I2CxRST (x=0,1,2): reset I2C
      \arg        RCU_USBFSRST: reset USBFS (only for GD32F350)
      \arg        RCU_PMURST: reset PMU
      \arg        RCU_DACRST: reset DAC (only for GD32F350)
      \arg        RCU_CECRST: reset CEC (only for GD32F350)
      \arg        RCU_CTCRST: reset CTC
    \param[out] none
    \retval     none
*/
void hal_rcu_periph_reset_disable(hal_rcu_periph_reset_enum periph_reset)
{
    RCU_REG_VAL(periph_reset) &= ~BIT(RCU_BIT_POS(periph_reset));
}

/*!
    \brief      initialize the RCU extended peripherals(RTC, Usart0, ADC, USBFS, CEC) clocks
    \param[in]  periph_clk: the pointer of peripheral clock structure
                  periph_clock_type(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_PERIPH_CLKTYPE_NONE: no clock type
      \arg          RCU_PERIPH_CLKTYPE_RTC: RTC clock type
      \arg          RCU_PERIPH_CLKTYPE_USART0: usart0 clock type
      \arg          RCU_PERIPH_CLKTYPE_ADC: ADC clock type
      \arg          RCU_PERIPH_CLKTYPE_USBFS: USBFS clock type
      \arg          RCU_PERIPH_CLKTYPE_CEC: USBFS clock type
                  rtc_clock_source(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_RTC_CLKSRC_NONE: RTC has no clock source
      \arg          RCU_RTC_CLKSRC_LXTAL: RTC select LXTAL as clock source
      \arg          RCU_RTC_CLKSRC_IRC40K: RTC select IRC40K as clock source
      \arg          RCU_RTC_CLKSRC_HXTAL_DIV32: RTC select HXTAL/32 as clock source
                  usart0_clock_source(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_USART0_CLKSRC_APB2: USART0 select APB2 as clock source
      \arg          RCU_USART0_CLKSRC_SYS: USART0 select SYSCLK as clock source
      \arg          RCU_USART0_CLKSRC_LXTAL: USART0 select LXTAL as clock source
      \arg          RCU_USART0_CLKSRC_IRC8M: USART0 select IRC8M as clock source
                  adc_clock_source(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_ADCCK_IRC28M_DIV2: ADC clock source select IRC28M/2
      \arg          RCU_ADCCK_IRC28M: ADC clock source select IRC28M
      \arg          RCU_ADCCK_APB2_DIV2: ADC clock source select APB2/2
      \arg          RCU_ADCCK_AHB_DIV3: ADC clock source select AHB/3
      \arg          RCU_ADCCK_APB2_DIV4: ADC clock source select APB2/4
      \arg          RCU_ADCCK_AHB_DIV5: ADC clock source select AHB/5
      \arg          RCU_ADCCK_APB2_DIV6: ADC clock source select APB2/6
      \arg          RCU_ADCCK_AHB_DIV7: ADC clock source select AHB/7
      \arg          RCU_ADCCK_APB2_DIV8: ADC clock source select APB2/8
      \arg          RCU_ADCCK_AHB_DIV9: ADC clock source select AHB/9
                  usbfs_clock_source(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_PLLCLK_USBFS_DIV1_5: USBFS clock prescaler select CK_PLL/1.5
      \arg          RCU_PLLCLK_USBFS_DIV1: USBFS clock prescaler select CK_PLL
      \arg          RCU_PLLCLK_USBFS_DIV2_5: USBFS clock prescaler select CK_PLL/2.5
      \arg          RCU_PLLCLK_USBFS_DIV2: USBFS clock prescaler select CK_PLL/2
      \arg          RCU_PLLCLK_USBFS_DIV3_5: USBFS clock prescaler select CK_PLL/3.5
      \arg          RCU_PLLCLK_USBFS_DIV3: USBFS clock prescaler select CK_PLL/3
                  cec_clock_source(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_CEC_CLKSRC_DIV244: CK_CEC clock source select IRC8M/244
      \arg          RCU_CEC_CLKSRC_LXTAL: CK_CEC clock source select LXTAL
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
*/
int32_t hal_rcu_periph_clock_config(hal_rcu_periphclk_struct *periph_clk)
{
    uint32_t backup_reg = 0U;
    FlagStatus pwr_state = RESET;

