PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rcu.c
#if (1 == HAL_PARAMETER_CHECK)

    if(NULL == periph_clk) {
        HAL_DEBUGE("parameter [periph_clk] is a NULL pointer.");

        return HAL_ERR_ADDRESS;
    }

    if(periph_clk->periph_clock_type > RCU_PERIPH_CLKTYPE_MAX) {
        HAL_DEBUGE("parameter member [periph_clk->periph_clock_type] is invalid.");

        return HAL_ERR_VAL;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure RTC clock */
    if(RCU_PERIPH_CLKTYPE_RTC == (periph_clk->periph_clock_type & RCU_PERIPH_CLKTYPE_RTC)) {
        /* need to enable pmu clock */
        if(RESET == (RCU_APB1EN & RCU_APB1EN_PMUEN)) {
            hal_rcu_periph_clk_enable(RCU_PMU);

            pwr_state = SET;
        }

        /* RTC clock need to activate backup domain */
        if(RESET == (PMU_CTL & PMU_CTL_BKPWEN)) {
            uint32_t tick_start = 0U;

            hals_pmu_backup_write_enable();

            tick_start = hal_sys_basetick_count_get();

            while(RESET == (PMU_CTL & PMU_CTL_BKPWEN)) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, HAL_BP_TIMEOUT)) {
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* check if the RTC clock source is modified */
        backup_reg = RCU_BDCTL & RCU_BDCTL_RTCSRC;

        if((0x00000000U != backup_reg) && \
                (backup_reg != (periph_clk->rtc_clock_source & RCU_BDCTL_RTCSRC))) {
            /* store the BDCTL register value before resetting the backup domain */
            backup_reg = RCU_BDCTL & ~RCU_BDCTL_RTCSRC;

            /* reset the backup domain */
            hals_rcu_bkp_reset_enable();
            hals_rcu_bkp_reset_disable();

            RCU_BDCTL = backup_reg;

            if(RESET != (backup_reg & RCU_BDCTL_LXTALEN)) {
                if(ERROR == hals_rcu_osci_stab_wait(RCU_LXTAL)) {
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* configure the RTC clock source */
        hals_rcu_rtc_clock_config(periph_clk->rtc_clock_source);

        if(SET == pwr_state) {
            hal_rcu_periph_clk_disable(RCU_PMU);

            pwr_state = RESET;
        }
    }

    /* configure the USART0 clock source */
    if(RCU_PERIPH_CLKTYPE_USART0 == (periph_clk->periph_clock_type & RCU_PERIPH_CLKTYPE_USART0)) {
        hals_rcu_usart_clock_config(periph_clk->usart0_clock_source);
    }

    /* configure the ADC clock source */
    if(RCU_PERIPH_CLKTYPE_ADC == (periph_clk->periph_clock_type & RCU_PERIPH_CLKTYPE_ADC)) {
        hals_rcu_adc_clock_config(periph_clk->adc_clock_source);
    }

#if defined(GD32F350)
    /* configure the CEC clock source */
    if(RCU_PERIPH_CLKTYPE_CEC == (periph_clk->periph_clock_type & RCU_PERIPH_CLKTYPE_CEC)) {
        hals_rcu_cec_clock_config(periph_clk->cec_clock_source);
    }

    /* configure the USBFS clock source */
    if(RCU_PERIPH_CLKTYPE_USBFS == (periph_clk->periph_clock_type & RCU_PERIPH_CLKTYPE_USBFS)) {
        hals_rcu_usbfs_clock_config(periph_clk->usbfs_clock_source);
    }
#endif /* GD32F350 */

    return HAL_ERR_NONE;
}

/*!
    \brief      get the peripherals clock frequency
    \param[in]  periph_clk:
                only one parameter can be selected which is shown as below:
      \arg        RCU_PERIPH_CLKTYPE_NONE: no clock type
      \arg        RCU_PERIPH_CLKTYPE_RTC: RTC clock type
      \arg        RCU_PERIPH_CLKTYPE_USART0: usart0 clock type
      \arg        RCU_PERIPH_CLKTYPE_ADC: ADC clock type
      \arg        RCU_PERIPH_CLKTYPE_APB1TIMER: APB1 timer clock type
      \arg        RCU_PERIPH_CLKTYPE_APB2TIMER: APB2 timer clock type
      \arg        RCU_PERIPH_CLKTYPE_CEC: CEC clock type
    \param[out] none
    \retval     peripheral clock frequency
*/
uint32_t hal_rcu_periph_clkfreq_get(uint32_t periph_clk)
{
    uint32_t periph_freq = 0U;
    uint32_t src_clk = 0U;

#if (1 == HAL_PARAMETER_CHECK)

    if(periph_clk >= RCU_PERIPH_CLKTYPE_MAX) {
        HAL_DEBUGE("parameter [periph_clk] is invalid.");

        return 0U;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(periph_clk) {
    case RCU_PERIPH_CLKTYPE_RTC:
        /* get the current RTC clock source */
        src_clk = RCU_BDCTL & RCU_BDCTL_RTCSRC;

        if((RCU_RTCSRC_LXTAL == src_clk) && (SET == hals_rcu_flag_get(RCU_FLAG_LXTALSTB))) {
            periph_freq = LXTAL_VALUE;
        } else if((RCU_RTCSRC_IRC40K == src_clk) && (SET == hals_rcu_flag_get(RCU_FLAG_IRC40KSTB))) {
            periph_freq = IRC40K_VALUE;
        } else if((RCU_RTCSRC_HXTAL_DIV32 == src_clk) && (SET == hals_rcu_flag_get(RCU_FLAG_HXTALSTB))) {
            periph_freq = HXTAL_VALUE / 32U;
        } else {
            periph_freq = 0U;
        }
        break;
    case RCU_PERIPH_CLKTYPE_USART0:
        /* get the current USART0 clock source */
        periph_freq = hals_rcu_clock_freq_get(CK_USART);
        break;
    case RCU_PERIPH_CLKTYPE_ADC:
        /* get the current ADC clock source */
        periph_freq = hals_rcu_clock_freq_get(CK_ADC);
        break;
#if defined(GD32F350)
    case RCU_PERIPH_CLKTYPE_CEC:
        /* get the current CEC clock source */
        periph_freq = hals_rcu_clock_freq_get(CK_CEC);
        break;
#endif /* GD32F350 */
    case RCU_PERIPH_CLKTYPE_APB1TIMER:
        /* get the current APB1 TIMER clock source */
        if(RCU_APB1_CKAHB_DIV1 == (RCU_CFG0 & RCU_CFG0_APB1PSC)) {
            periph_freq = hals_rcu_clock_freq_get(CK_APB1);
        } else {
            periph_freq = hals_rcu_clock_freq_get(CK_APB1) * 2;
        }
        break;
    case RCU_PERIPH_CLKTYPE_APB2TIMER:
        /* get the current APB2 TIMER clock source */
        if(RCU_APB2_CKAHB_DIV1 == (RCU_CFG0 & RCU_CFG0_APB2PSC)) {
            periph_freq = hals_rcu_clock_freq_get(CK_APB2);
        } else {
            periph_freq = hals_rcu_clock_freq_get(CK_APB2) * 2;
        }
        break;
    default:
        break;
    }

    return periph_freq;
}

/*!
    \brief      get the RCU oscillators configuration
    \param[in]  rcu_osci: the pointer of the RCU oscillators structure
                  hxtal: HXTAL status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  lxtal: LXTAL status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  irc28m: IRC28M status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    calibration_value: calibration value
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  irc8m: IRC8M status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    calibration_value: calibration value
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  irc40k: IRC40K status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                  pll: PLL status structure
                    need_cofigure: configure flag, can be ENABLE or DISABLE
                    status: the argument could be selected from enumeration <hal_rcu_osc_state_enum>
                    pll_source: RCU_PLL_SRC_HXTAL, RCU_PLL_SRC_IRC8M_DIV2
                    pre_div: the argument could be selected from enumeration <hal_rcu_pll_prediv_enum>
                    pll_mul: the argument could be selected from enumeration <hal_rcu_pll_mul_enum>
    \param[out] none
    \retval     none
*/
void hal_rcu_osci_config_get(hal_rcu_osci_struct *rcu_osci)
{
#if (1 == HAL_PARAMETER_CHECK)

    if(NULL == rcu_osci) {
        HAL_DEBUGE("parameter [rcu_osci] is a NULL pointer.");

        return;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure all the oscillator type */
    rcu_osci->hxtal.need_configure = ENABLE;
    rcu_osci->lxtal.need_configure = ENABLE;
    rcu_osci->irc8m.need_configure = ENABLE;
    rcu_osci->irc28m.need_configure = ENABLE;
    rcu_osci->irc48m.need_configure = ENABLE;
    rcu_osci->irc40k.need_configure = ENABLE;
    rcu_osci->pll.need_configure = ENABLE;

