PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rcu.c
    /* get the current HXTAL state */
    if(RESET != (RCU_CTL0 & RCU_CTL0_HXTALBPS)) {
        rcu_osci->hxtal.state = RCU_OSC_BYPASS;
    } else if(RESET != (RCU_CTL0 & RCU_CTL0_HXTALEN)) {
        rcu_osci->hxtal.state = RCU_OSC_ON;
    } else {
        rcu_osci->hxtal.state = RCU_OSC_OFF;
    }

    /* get the current LXTAL state */
    if(RESET != (RCU_BDCTL & RCU_BDCTL_LXTALBPS)) {
        rcu_osci->lxtal.state = RCU_OSC_BYPASS;
    } else if(RESET != (RCU_BDCTL & RCU_BDCTL_LXTALEN)) {
        rcu_osci->lxtal.state = RCU_OSC_ON;
    } else {
        rcu_osci->lxtal.state = RCU_OSC_OFF;
    }

    /* get the current IRC8M state and adjust value */
    if(RESET != (RCU_CTL0 & RCU_CTL0_IRC8MEN)) {
        rcu_osci->irc8m.state = RCU_OSC_ON;
    } else {
        rcu_osci->irc8m.state = RCU_OSC_OFF;
    }

    rcu_osci->irc8m.adjust_value = (uint8_t)((RCU_CTL0 & RCU_CTL0_IRC8MCALIB) >> 8);

    /* get the current IRC28M state and adjust value */
    if(RESET == (RCU_CFG2 & RCU_CFG2_ADCSEL)) {
        rcu_osci->irc28m.state = RCU_OSC_ADCCTL;
    } else {
        if(RESET != (RCU_CTL1 & RCU_CTL1_IRC28MEN)) {
            rcu_osci->irc28m.state = RCU_OSC_ON;
        } else {
            rcu_osci->irc28m.state = RCU_OSC_OFF;
        }
    }

    rcu_osci->irc28m.adjust_value = (uint8_t)((RCU_CTL1 & RCU_CTL1_IRC28MCALIB) >> 8);

    /* get the current IRC48M state */

    if(RESET != (RCU_ADDCTL & RCU_ADDCTL_IRC48MEN)) {
        rcu_osci->irc48m.state = RCU_OSC_ON;
    } else {
        rcu_osci->irc48m.state = RCU_OSC_OFF;
    }


    /* get the current IRC40K state */
    if(RESET != (RCU_RSTSCK & RCU_RSTSCK_IRC40KEN)) {
        rcu_osci->irc40k.state = RCU_OSC_ON;
    } else {
        rcu_osci->irc40k.state = RCU_OSC_OFF;
    }

    /* get the current PLL state */
    if(RESET != (RCU_CTL0 & RCU_CTL0_PLLEN)) {
        rcu_osci->pll.state = RCU_OSC_ON;
    } else {
        rcu_osci->pll.state = RCU_OSC_OFF;
    }

    /* get the PLL parameters */
    rcu_osci->pll.pll_mul = (hal_rcu_pll_mul_enum)(RCU_CFG0 & RCU_CFG0_PLLMF);
    rcu_osci->pll.pll_source = (hal_rcu_pll_src_enum)(RCU_CFG0 & RCU_CFG0_PLLSEL);
    rcu_osci->pll.pre_div = (hal_rcu_pll_prediv_enum)(RCU_CFG0 & RCU_CFG0_PLLPREDV);
    rcu_osci->pll.pll_presel = (hal_rcu_pll_presel_enum)(RCU_CFG1 & RCU_CFG1_PLLPRESEL);
}

/*!
    \brief      configure the RCU clock
    \param[in]  rcu_clk: the pointer of the RCU clock structure
                  clock_type(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_CLKTYPE_NONE: no clock type
      \arg          RCU_CLKTYPE_SYSCLK: system clock type
      \arg          RCU_CLKTYPE_CK48MCLK: ck48m clock to configure
      \arg          RCU_CLKTYPE_AHBCLK: AHB bus clock type
      \arg          RCU_CLKTYPE_APB1CLK: APB1 bus clock type
      \arg          RCU_CLKTYPE_APB2CLK: APB2 bus clock type
                  sysclk_source(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_SYSCLK_SRC_IRC8M: IRC8M as system clock source
      \arg          RCU_SYSCLK_SRC_HXTAL: HXTAL as system clock source
      \arg          RCU_SYSCLK_SRC_PLL: PLL as system clock source
                  ck48mclk_source(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_USB_CK48MSRC_PLL48M: CK48M source clock select PLL48M
      \arg          RCU_USB_CK48MSRC_IRC48M: CK48M source clock select IRC48M
                  ahbclk_divider(member): AHB clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_ahbdiv_enum>
                  apb1clk_divider(member): APB1 clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_apb1div_enum>
                  apb2clk_divider(member): APB2 clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_apb2div_enum>
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_TIMEOUT, details refer to gd32f3x0_hal.h
    \note       user need compute the AHB clock freuuency before, then decide the fmc_wscnt value
*/

int32_t hal_rcu_clock_config(hal_rcu_clk_struct *rcu_clk)
{
#if (1 == HAL_PARAMETER_CHECK)

    if(NULL == rcu_clk) {
        HAL_DEBUGE("parameter [rcu_clk] is a NULL pointer.");

        return HAL_ERR_ADDRESS;
    }

    if(rcu_clk->clock_type > RCU_CLKTYPE_MAX) {
        HAL_DEBUGE("parameter member [rcu_clk->clock_type] is invalid.");

        return HAL_ERR_VAL;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    /* configure system clock */
    if(RCU_CLKTYPE_SYSCLK == (rcu_clk->clock_type & RCU_CLKTYPE_SYSCLK)) {
        uint32_t tick_start = 0U;
        uint32_t time_out = s_rcu_timeout[_RCU_CKSYSSRC_INDEX(rcu_clk->sysclk_source)];

        if(RESET == hals_rcu_flag_get(s_rcu_stab_flag[_RCU_CKSYSSRC_INDEX(rcu_clk->sysclk_source)])) {
            return HAL_ERR_VAL;
        }

        /* configure the system clock source */
        hals_rcu_system_clock_source_config(rcu_clk->sysclk_source);

        tick_start = hal_sys_basetick_count_get();

        /* wait till system clock source is stable */
        while(s_rcu_scss[_RCU_CKSYSSRC_INDEX(rcu_clk->sysclk_source)] != hals_rcu_system_clock_source_get()) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, time_out)) {
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    /* configure ck48m clock */
    if(RCU_CLKTYPE_CK48MCLK == (rcu_clk->clock_type & RCU_CLKTYPE_CK48MCLK)) {
        /* configure ck48m clock */
        hals_rcu_ck48m_clock_config(rcu_clk->ck48mclk_source);
    }

    /* configure AHB bus clock */
    if(RCU_CLKTYPE_AHBCLK == (rcu_clk->clock_type & RCU_CLKTYPE_AHBCLK)) {
        /* configure AHB clock */
        hals_rcu_ahb_clock_config(rcu_clk->ahbclk_divider);
    }

    /* configure APB1 bus clock */
    if(RCU_CLKTYPE_APB1CLK == (rcu_clk->clock_type & RCU_CLKTYPE_APB1CLK)) {
        hals_rcu_apb1_clock_config(rcu_clk->apb1clk_divider);
    }

    /* configure APB2 bus clock */
    if(RCU_CLKTYPE_APB2CLK == (rcu_clk->clock_type & RCU_CLKTYPE_APB2CLK)) {
        hals_rcu_apb2_clock_config(rcu_clk->apb2clk_divider);
    }

    /* update the SystemCoreClock global variable */
    g_systemcoreclock = hals_rcu_clock_freq_get(CK_SYS);

