PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rcu.c
    /* configure the source of time base considering new system clocks settings */
    hal_sys_timesource_init(g_basetick_source);

    return HAL_ERR_NONE;
}

/*!
    \brief      get the RCU clock configuration
    \param[in]  rcu_clk: the pointer of the RCU clock structure
                  clock_type(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_CLKTYPE_NONE: no clock type
      \arg          RCU_CLKTYPE_SYSCLK: system clock type
      \arg          RCU_CLKTYPE_CK48MCLK: ck48m clock to configure
      \arg          RCU_CLKTYPE_AHBCLK: AHB bus clock type
      \arg          RCU_CLKTYPE_APB1CLK: APB1 bus clock type
      \arg          RCU_CLKTYPE_APB2CLK: APB2 bus clock type
                  sysclk_source(member):
                  only one parameter can be selected which is shown as below:
      \arg          RCU_SYSCLK_SRC_IRC8M: IRC8M as system clock source
      \arg          RCU_SYSCLK_SRC_HXTAL: HXTAL as system clock source
      \arg          RCU_SYSCLK_SRC_PLL: PLL as system clock source
                  ahbclk_divider(member): AHB clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_ahbdiv_enum>
                  apb1clk_divider(member): APB1 clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_apb1div_enum>
                  apb2clk_divider(member): APB2 clock divider
                    the argument could be selected from enumeration <hal_rcu_sysclk_apb2div_enum>
    \param[out] none
    \retval     none
*/
void hal_rcu_clock_config_get(hal_rcu_clk_struct *rcu_clk)
{
#if (1 == HAL_PARAMETER_CHECK)

    if(NULL == rcu_clk) {
        HAL_DEBUGE("parameter [rcu_clk] is a NULL pointer.");

        return;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    /* get all clock type configuration */
    rcu_clk->clock_type = RCU_CLKTYPE_SYSCLK | RCU_CLKTYPE_CK48MCLK | RCU_CLKTYPE_AHBCLK | RCU_CLKTYPE_APB1CLK | RCU_CLKTYPE_APB2CLK;
    rcu_clk->sysclk_source = (hal_rcu_sysclk_src_enum)(RCU_CFG0 & RCU_CFG0_SCS);
    rcu_clk->ck48mclk_source = (hal_rcu_ck48mclk_src_enum)(RCU_ADDCTL & RCU_ADDCTL_CK48MSEL);
    rcu_clk->ahbclk_divider = (hal_rcu_sysclk_ahbdiv_enum)(RCU_CFG0 & RCU_CFG0_AHBPSC);
    rcu_clk->apb1clk_divider = (hal_rcu_ahbclk_apbldiv_enum)(RCU_CFG0 & RCU_CFG0_APB1PSC);
    rcu_clk->apb2clk_divider = (hal_rcu_ahbclk_apb2div_enum)(RCU_CFG0 & RCU_CFG0_APB2PSC);
}

/*!
    \brief      update the SystemCoreClock with current core clock retrieved from cpu registers
    \param[in]  none
    \param[out] none
    \retval     none
*/
int32_t hal_SystemCoreClockUpdate(void)
{
    int32_t sws = 0U;
    int32_t pllmf = 0U, pllmf4 = 0U, pllmf5 = 0U, pllsel = 0U, pllpresel = 0U, prediv = 0U, idx = 0U, clk_exp = 0U;
    /* exponent of AHB clock divider */
    const uint8_t ahb_exp[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

    sws = GET_BITS(RCU_CFG0, 2, 3);
    switch(sws) {
    /* IRC8M is selected as CK_SYS */
    case SEL_IRC8M:
        g_systemcoreclock = IRC8M_VALUE;
        break;
    /* HXTAL is selected as CK_SYS */
    case SEL_HXTAL:
        g_systemcoreclock = HXTAL_VALUE;
        break;
    /* PLL is selected as CK_SYS */
    case SEL_PLL:
        /* get the value of PLLMF[3:0] */
        pllmf = GET_BITS(RCU_CFG0, 18, 21);
        pllmf4 = GET_BITS(RCU_CFG0, 27, 27);
        pllmf5 = GET_BITS(RCU_CFG1, 31, 31);
        /* high 16 bits */
        if((0U == pllmf4) && (0U == pllmf5)) {
            pllmf += 2U;
        }
        if((1U == pllmf4) && (0U == pllmf5)) {
            pllmf += 17U;
        }
        if((0U == pllmf4) && (1U == pllmf5)) {
            pllmf += 33U;
        }
        if((1U == pllmf4) && (1U == pllmf5)) {
            pllmf += 49U;
        }
        /* PLL clock source selection, HXTAL or IRC8M/2 */
        pllsel = GET_BITS(RCU_CFG0, 16, 16);
        if(0U != pllsel) {
            prediv = (GET_BITS(RCU_CFG1, 0, 3) + 1U);
            if(0U == pllpresel) {
                g_systemcoreclock = (HXTAL_VALUE / prediv) * pllmf;
            } else {
                g_systemcoreclock = (IRC48M_VALUE / prediv) * pllmf;
            }
        } else {
            g_systemcoreclock = (IRC8M_VALUE >> 1) * pllmf;
        }
        break;
    /* IRC8M is selected as CK_SYS */
    default:
        g_systemcoreclock = IRC8M_VALUE;
        break;
    }
    /* calculate AHB clock frequency */
    idx = GET_BITS(RCU_CFG0, 4, 7);
    clk_exp = ahb_exp[idx];
    g_systemcoreclock >>= clk_exp;

    return g_systemcoreclock;
}

/*!
    \brief      RCU interrupt handler content function,which is merely used in RCU_handler
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rcu_irq(void)
{
    /* IRC40K stable interrupt handler */
    if(SET == hals_rcu_interrupt_flag_get(RCU_INT_FLAG_IRC40KSTB)) {
        hals_rcu_interrupt_flag_clear(RCU_INT_FLAG_IRC40KSTB_CLR);
        if(NULL != rcu_irq.irc40k_stable_handle) {
            rcu_irq.irc40k_stable_handle(NULL);
        }
    }

    /* IRC8M stable interrupt handler */
    if(SET == hals_rcu_interrupt_flag_get(RCU_INT_FLAG_IRC8MSTB)) {
        hals_rcu_interrupt_flag_clear(RCU_INT_FLAG_IRC8MSTB_CLR);
        if(NULL != rcu_irq.irc8m_stable_handle) {
            rcu_irq.irc8m_stable_handle(NULL);
        }
    }

    /* IRC28M stable interrupt handler */
    if(SET == hals_rcu_interrupt_flag_get(RCU_INT_FLAG_IRC28MSTB)) {
        hals_rcu_interrupt_flag_clear(RCU_INT_FLAG_IRC28MSTB_CLR);
        if(NULL != rcu_irq.irc28m_stable_handle) {
            rcu_irq.irc28m_stable_handle(NULL);
        }
    }

    /* IRC48M stable interrupt handler */
    if(SET == hals_rcu_interrupt_flag_get(RCU_INT_FLAG_IRC48MSTB)) {
        hals_rcu_interrupt_flag_clear(RCU_INT_FLAG_IRC48MSTB_CLR);
        if(NULL != rcu_irq.irc48m_stable_handle) {
            rcu_irq.irc48m_stable_handle(NULL);
        }
    }

    /* LXTAL stable interrupt handler */
    if(SET == hals_rcu_interrupt_flag_get(RCU_INT_FLAG_LXTALSTB)) {
        hals_rcu_interrupt_flag_clear(RCU_INT_FLAG_LXTALSTB_CLR);
        if(NULL != rcu_irq.lxtal_stable_handle) {
            rcu_irq.lxtal_stable_handle(NULL);
        }
    }

    /* HXTAL stable interrupt handler */
    if(SET == hals_rcu_interrupt_flag_get(RCU_INT_FLAG_HXTALSTB)) {
        hals_rcu_interrupt_flag_clear(RCU_INT_FLAG_HXTALSTB_CLR);
        if(NULL != rcu_irq.hxtal_stable_handle) {
            rcu_irq.hxtal_stable_handle(NULL);
        }
    }

