PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rcu.c
    /* PLL stable interrupt handler */
    if(SET == hals_rcu_interrupt_flag_get(RCU_INT_FLAG_PLLSTB)) {
        hals_rcu_interrupt_flag_clear(RCU_INT_FLAG_PLLSTB_CLR);
        if(NULL != rcu_irq.pll_stable_handle) {
            rcu_irq.pll_stable_handle(NULL);
        }
    }

    /* HXTAL stuck interrupt handler */
    if(SET == hals_rcu_interrupt_flag_get(RCU_INT_FLAG_CKM)) {
        hals_rcu_interrupt_flag_clear(RCU_INT_FLAG_CKM_CLR);
        if(NULL != rcu_irq.hxtal_stuck_handle) {
            rcu_irq.hxtal_stuck_handle(NULL);
        }
    }
}

/*!
    \brief      set user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  prcu_irq: pointer of RCU interrupt handler structure
    \param[out] none
    \retval     none
*/
void hal_rcu_irq_handle_set(hal_rcu_irq_struct *prcu_irq)
{
#if (1 == HAL_PARAMETER_CHECK)

    if(NULL == prcu_irq) {
        HAL_DEBUGE("parameter [prcu_irq] is a NULL pointer.");

        return;
    }

#endif /* 1 == HAL_PARAMETER_CHECK */

    /* HXTAL stable interrupt handler set */
    if(NULL != prcu_irq->hxtal_stable_handle) {
        rcu_irq.hxtal_stable_handle = prcu_irq->hxtal_stable_handle;

        hals_rcu_interrupt_enable(RCU_INT_HXTALSTB);
    } else {
        rcu_irq.hxtal_stable_handle = NULL;

        hals_rcu_interrupt_disable(RCU_INT_HXTALSTB);
    }

    /* IRC28M stable interrupt handler set */
    if(NULL != prcu_irq->irc28m_stable_handle) {
        rcu_irq.irc28m_stable_handle = prcu_irq->irc28m_stable_handle;

        hals_rcu_interrupt_enable(RCU_INT_IRC28MSTB);
    } else {
        rcu_irq.irc28m_stable_handle = NULL;

        hals_rcu_interrupt_disable(RCU_INT_IRC28MSTB);
    }

    /* IRC48M stable interrupt handler set */
    if(NULL != prcu_irq->irc48m_stable_handle) {
        rcu_irq.irc48m_stable_handle = prcu_irq->irc48m_stable_handle;

        hals_rcu_interrupt_enable(RCU_INT_IRC48MSTB);
    } else {
        rcu_irq.irc48m_stable_handle = NULL;

        hals_rcu_interrupt_disable(RCU_INT_IRC48MSTB);
    }

    /* IRC40K stable interrupt handler set */
    if(NULL != prcu_irq->irc40k_stable_handle) {
        rcu_irq.irc40k_stable_handle = prcu_irq->irc40k_stable_handle;

        hals_rcu_interrupt_enable(RCU_INT_IRC40KSTB);
    } else {
        rcu_irq.irc40k_stable_handle = NULL;

        hals_rcu_interrupt_disable(RCU_INT_IRC40KSTB);
    }

    /* IRC8M stable interrupt handler set */
    if(NULL != prcu_irq->irc8m_stable_handle) {
        rcu_irq.irc8m_stable_handle = prcu_irq->irc8m_stable_handle;

        hals_rcu_interrupt_enable(RCU_INT_IRC8MSTB);
    } else {
        rcu_irq.irc8m_stable_handle = NULL;

        hals_rcu_interrupt_disable(RCU_INT_IRC8MSTB);
    }

    /* LXTAL stable interrupt handler set */
    if(NULL != prcu_irq->lxtal_stable_handle) {
        rcu_irq.lxtal_stable_handle = prcu_irq->lxtal_stable_handle;

        hals_rcu_interrupt_enable(RCU_INT_LXTALSTB);
    } else {
        rcu_irq.lxtal_stable_handle = NULL;

        hals_rcu_interrupt_disable(RCU_INT_LXTALSTB);
    }

    /* PLL stable interrupt handler set */
    if(NULL != prcu_irq->pll_stable_handle) {
        rcu_irq.pll_stable_handle = prcu_irq->pll_stable_handle;

        hals_rcu_interrupt_enable(RCU_INT_PLLSTB);
    } else {
        rcu_irq.pll_stable_handle = NULL;

        hals_rcu_interrupt_disable(RCU_INT_PLLSTB);
    }

    /* HXTAL stuck interrupt handler set */
    if(NULL != prcu_irq->hxtal_stuck_handle) {
        rcu_irq.hxtal_stuck_handle = prcu_irq->hxtal_stuck_handle;
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rcu_irq_handle_all_reset(void)
{
    /* reset all interrupt handler */
    rcu_irq.hxtal_stable_handle = NULL;
    rcu_irq.hxtal_stuck_handle = NULL;
    rcu_irq.irc48m_stable_handle = NULL;
    rcu_irq.irc28m_stable_handle = NULL;
    rcu_irq.irc40k_stable_handle = NULL;
    rcu_irq.irc8m_stable_handle = NULL;
    rcu_irq.lxtal_stable_handle = NULL;
    rcu_irq.pll_stable_handle = NULL;
}

/*!
    \brief      reset the BKP
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_rcu_bkp_reset_enable(void)
{
    RCU_BDCTL |= RCU_BDCTL_BKPRST;
}

/*!
    \brief      disable the BKP reset
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_rcu_bkp_reset_disable(void)
{
    RCU_BDCTL &= ~RCU_BDCTL_BKPRST;
}

/*!
    \brief      get the clock stabilization and periphral reset flags
    \param[in]  flag: the clock stabilization and periphral reset flags, refer to rcu_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_IRC40KSTB: IRC40K stabilization flag
      \arg        RCU_FLAG_LXTALSTB: LXTAL stabilization flag
      \arg        RCU_FLAG_IRC8MSTB: IRC8M stabilization flag
      \arg        RCU_FLAG_HXTALSTB: HXTAL stabilization flag
      \arg        RCU_FLAG_PLLSTB: PLL stabilization flag
      \arg        RCU_FLAG_IRC28MSTB: IRC28M stabilization flag
      \arg        RCU_FLAG_IRC48MSTB: IRC48M stabilization flag
      \arg        RCU_FLAG_V12RST: V12 domain power reset flag
      \arg        RCU_FLAG_OBLRST: option byte loader reset flag
      \arg        RCU_FLAG_EPRST: external pin reset flag
      \arg        RCU_FLAG_PORRST: power reset flag
      \arg        RCU_FLAG_SWRST: software reset flag
      \arg        RCU_FLAG_FWDGTRST: free watchdog timer reset flag
      \arg        RCU_FLAG_WWDGTRST: window watchdog timer reset flag
      \arg        RCU_FLAG_LPRST: low-power reset flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_rcu_flag_get(hal_rcu_flag_enum flag)
{
    if(RESET != (RCU_REG_VAL(flag) & BIT(RCU_BIT_POS(flag)))) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear the reset flag
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_rcu_all_reset_flag_clear(void)
{
    RCU_RSTSCK |= RCU_RSTSCK_RSTFC;
}

/*!
    \brief      wait until oscillator stabilization flags is SET
    \param[in]  osci: oscillator types, refer to rcu_osci_type_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_HXTAL: HXTAL
      \arg        RCU_LXTAL: LXTAL
      \arg        RCU_IRC8M: IRC8M
      \arg        RCU_IRC28M: IRC28M
      \arg        RCU_IRC48M: IRC48M
      \arg        RCU_IRC40K: IRC40K
      \arg        RCU_PLL_CK: PLL
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus hals_rcu_osci_stab_wait(hal_rcu_osci_type_enum osci)
{
    uint32_t stb_cnt = 0U;
    ErrStatus reval = ERROR;
    FlagStatus osci_stat = RESET;
    switch(osci) {
    case RCU_HXTAL:
        /* wait until HXTAL is stabilization and osci_stat is not more than timeout */
        while((RESET == osci_stat) && (HXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = hals_rcu_flag_get(RCU_FLAG_HXTALSTB);
            stb_cnt++;
        }
        if(RESET != hals_rcu_flag_get(RCU_FLAG_HXTALSTB)) {
            reval = SUCCESS;
        }
        break;
    /* wait LXTAL stable */
    case RCU_LXTAL:
        while((RESET == osci_stat) && (LXTAL_STARTUP_TIMEOUT != stb_cnt)) {
            osci_stat = hals_rcu_flag_get(RCU_FLAG_LXTALSTB);
            stb_cnt++;
        }

